import {ScoreCalcItem, ScoreCalcItemType} from '../type.ts';

const script = `
var calc = function() {
    return [1, []];
}
`;

const HistoryFacultyScoreCalc: ScoreCalcItem = {
  author: 'orangeboy',
  brief: '简要说明',
  date: '2022-3-17',
  desc: '描述符简要说明简说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明简要说明',
  script: script,
  title:
    '历史学院历史学院历史学院历史学院历史学院历史学院历史学院历史学院历史学院',
  type: ScoreCalcItemType.APP,
  updateBrief: '简要说明更新了什么222',
  version: 1,
  url: '',
};

export default HistoryFacultyScoreCalc;
